experimental_cases/OF9/disengagement/bubble_column_Krishna/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiphaseEulerFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       0.0005;


functions
{
 /*   disengagement
    {
        type            disengagement;
        libs            ("libbirdmultiphaseEulerFoamFunctionObjects.so");

        //- Properties common to all functionObjects
        executeControl  runTime;
        executeInterval 0.01;
        writeControl    runTime;
        writeInterval   0.1; 

        //- Properties specific of this functionobject
        phase           liquid;
        inletPhase      gas;
        inlet           inlet;
        tolerance       1e-2;
        direction       (0 0 1);
        nsamples        200;
        disengage       false;   
    } */

    pressure_area
    {
        // Mandatory entries (unmodifiable)
        type            surfaceFieldValue;
        libs            ("fieldFunctionObjects");

        // Mandatory entries (runtime modifiable)
        fields          (p_rgh);
        operation       areaAverage;
        regionType      patch;
        name            inlet;

    }
}


// ************************************************************************* //
